Summer2025/source/lectures/L03/cases/RandomDisks/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name inletFaceSet;
        type faceSet;
        action new;
        source boxToFace;
        sourceInfo
        {
            box ( -1e-6 0 0 ) ( 1e-6 1256 1256 );
        }
    }

    {
        name outletFaceSet;
        type faceSet;
        action new;
        source boxToFace;
        sourceInfo
        {
            box ( 1255.9999 0 0 ) ( 1256.0001 1256 1256 );
        }
    }

    {
        name bottomFaceSet;
        type faceSet;
        action new;
        source boxToFace;
        sourceInfo
        {
            box ( 0 -1e-6 0 ) ( 1256 1e-6 1256 );
        }
    }

    {
        name topFaceSet;
        type faceSet;
        action new;
        source boxToFace;
        sourceInfo
        {
            box ( 0 1255.9999 0 ) ( 1256 1256.0001 1256 );
        }
    }
);
